ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR32DA32def.inc
.equ USERROW_USERROW0 = 0x1080           ; User Row Byte 0
.equ USERROW_USERROW1 = 0x1081           ; User Row Byte 1
.equ USERROW_USERROW2 = 0x1082           ; User Row Byte 2
.equ USERROW_USERROW3 = 0x1083           ; User Row Byte 3
.equ USERROW_USERROW4 = 0x1084           ; User Row Byte 4
.equ USERROW_USERROW5 = 0x1085           ; User Row Byte 5
.equ USERROW_USERROW6 = 0x1086           ; User Row Byte 6
.equ USERROW_USERROW7 = 0x1087           ; User Row Byte 7
.equ USERROW_USERROW8 = 0x1088           ; User Row Byte 8
.equ USERROW_USERROW9 = 0x1089           ; User Row Byte 9
.equ USERROW_USERROW10 = 0x108A          ; User Row Byte 10
.equ USERROW_USERROW11 = 0x108B          ; User Row Byte 11
.equ USERROW_USERROW12 = 0x108C          ; User Row Byte 12
.equ USERROW_USERROW13 = 0x108D          ; User Row Byte 13
.equ USERROW_USERROW14 = 0x108E          ; User Row Byte 14
.equ USERROW_USERROW15 = 0x108F          ; User Row Byte 15
.equ USERROW_USERROW16 = 0x1090          ; User Row Byte 16
.equ USERROW_USERROW17 = 0x1091          ; User Row Byte 17
.equ USERROW_USERROW18 = 0x1092          ; User Row Byte 18
.equ USERROW_USERROW19 = 0x1093          ; User Row Byte 19
.equ USERROW_USERROW20 = 0x1094          ; User Row Byte 20
.equ USERROW_USERROW21 = 0x1095          ; User Row Byte 21
.equ USERROW_USERROW22 = 0x1096          ; User Row Byte 22
.equ USERROW_USERROW23 = 0x1097          ; User Row Byte 23
.equ USERROW_USERROW24 = 0x1098          ; User Row Byte 24
.equ USERROW_USERROW25 = 0x1099          ; User Row Byte 25
.equ USERROW_USERROW26 = 0x109A          ; User Row Byte 26
.equ USERROW_USERROW27 = 0x109B          ; User Row Byte 27
.equ USERROW_USERROW28 = 0x109C          ; User Row Byte 28
.equ USERROW_USERROW29 = 0x109D          ; User Row Byte 29
.equ USERROW_USERROW30 = 0x109E          ; User Row Byte 30
.equ USERROW_USERROW31 = 0x109F          ; User Row Byte 31

;*************************************************************************
;** VPORTA - Virtual Ports
;*************************************************************************

.equ VPORTA_DIR = 0x0000                 ; Data Direction
.equ VPORTA_OUT = 0x0001                 ; Output Value
.equ VPORTA_IN = 0x0002                  ; Input Value
.equ VPORTA_INTFLAGS = 0x0003            ; Interrupt Flags

;*************************************************************************
;** VPORTC - Virtual Ports
;*************************************************************************

.equ VPORTC_DIR = 0x0008                 ; Data Direction
.equ VPORTC_OUT = 0x0009                 ; Output Value
.equ VPORTC_IN = 0x000A                  ; Input Value
.equ VPORTC_INTFLAGS = 0x000B            ; Interrupt Flags

;*************************************************************************
;** VPORTD - Virtual Ports
;*************************************************************************

.equ VPORTD_DIR = 0x000C                 ; Data Direction
.equ VPORTD_OUT = 0x000D                 ; Output Value
.equ VPORTD_IN = 0x000E                  ; Input Value
.equ VPORTD_INTFLAGS = 0x000F            ; Interrupt Flags

;*************************************************************************
;** VPORTF - Virtual Ports
;*************************************************************************

.equ VPORTF_DIR = 0x0014                 ; Data Direction
.equ VPORTF_OUT = 0x0015                 ; Output Value
.equ VPORTF_IN = 0x0016                  ; Input Value
.equ VPORTF_INTFLAGS = 0x0017            ; Interrupt Flags

;*************************************************************************
;** VREF - Voltage reference
;*************************************************************************

.equ VREF_ADC0REF = 0x00A0               ; ADC0 Reference
.equ VREF_DAC0REF = 0x00A2               ; DAC0 Reference
.equ VREF_ACREF = 0x00A4                 ; AC Reference

;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************

.equ WDT_CTRLA = 0x0100                  ; Control A
.equ WDT_STATUS = 0x0101                 ; Status

;*************************************************************************
;** ZCD0 - Zero Cross Detect
;*************************************************************************

.equ ZCD0_CTRLA = 0x06C0                 ; Control A
.equ ZCD0_INTCTRL = 0x06C2               ; Interrupt Control
.equ ZCD0_STATUS = 0x06C3                ; Status


; ***** ALL MODULE BASE ADRESSES *****************************************

.equ AC0_base = 0x0680                   ; Analog Comparator
.equ AC1_base = 0x0688                   ; Analog Comparator
.equ AC2_base = 0x0690                   ; Analog Comparator
.equ ADC0_base = 0x0600                  ; Analog to Digital Converter
.equ BOD_base = 0x0080                   ; Bod interface
.equ CCL_base = 0x01C0                   ; Configurable Custom Logic
.equ CLKCTRL_base = 0x0060               ; Clock controller
.equ CPU_base = 0x0030                   ; CPU
.equ CPUINT_base = 0x0110                ; Interrupt Controller
.equ CRCSCAN_base = 0x0120               ; CRCSCAN
.equ DAC0_base = 0x06A0                  ; Digital to Analog Converter
.equ EVSYS_base = 0x0200                 ; Event System
.equ FUSE_base = 0x1050                  ; Fuses
.equ GPR_base = 0x001C                   ; General Purpose Registers
.equ LOCK_base = 0x1040                  ; Lockbits
.equ NVMCTRL_base = 0x1000               ; Non-volatile Memory Controller
.equ PORTA_base = 0x0400                 ; I/O Ports
.equ PORTC_base = 0x0440                 ; I/O Ports
.equ PORTD_base = 0x0460                 ; I/O Ports
.equ PORTF_base = 0x04A0                 ; I/O Ports
.equ PORTMUX_base = 0x05E0               ; Port Multiplexer
.equ RSTCTRL_base = 0x0040               ; Reset controller
.equ RTC_base = 0x0140                   ; Real-Time Counter
.equ SIGROW_base = 0x1100                ; Signature row
.equ SLPCTRL_base = 0x0050               ; Sleep Controller
.equ SPI0_base = 0x0940                  ; Serial Peripheral Interface
.equ SPI1_base = 0x0960                  ; Serial Peripheral Interface
.equ SYSCFG_base = 0x0F00                ; System Configuration Registers
.equ TCA0_base = 0x0A00                  ; 16-bit Timer/Counter Type A
.equ TCB0_base = 0x0B00                  ; 16-bit Timer Type B
.equ TCB1_base = 0x0B10                  ; 16-bit Timer Type B
.equ TCB2_base = 0x0B20                  ; 16-bit Timer Type B
.equ TCD0_base = 0x0B80                  ; Timer Counter D
.equ TWI0_base = 0x0900                  ; Two-Wire Interface
.equ TWI1_base = 0x0920                  ; Two-Wire Interface
.equ USART0_base = 0x0800                ; Universal Synchronous and Asynchronous Receiver and Transmitter
.equ USART1_base = 0x0820                ; Universal Synchronous and Asynchronous Receiver and Transmitter
.equ USART2_base = 0x0840                ; Universal Synchronous and Asynchronous Receiver and Transmitter
.equ USERROW_base = 0x1080               ; User Row
.equ VPORTA_base = 0x0000                ; Virtual Ports
.equ VPORTC_base = 0x0008                ; Virtual Ports
.equ VPORTD_base = 0x000C                ; Virtual Ports
.equ VPORTF_base = 0x0014                ; Virtual Ports
.equ VREF_base = 0x00A0                  ; Voltage reference
.equ WDT_base = 0x0100                   ; Watch-Dog Timer
.equ ZCD0_base = 0x06C0                  ; Zero Cross Detect


