ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR32DA32def.inc
; TCB0 interrupt vector offsets

.equ TCB0_INT_voffset = 0

; TCB1 interrupt vector offsets

.equ TCB1_INT_voffset = 0

; TCD0 interrupt vector offsets

.equ TCD0_OVF_voffset = 0
.equ TCD0_TRIG_voffset = 2

; TWI0 interrupt vector offsets

.equ TWI0_TWIS_voffset = 0
.equ TWI0_TWIM_voffset = 2

; SPI0 interrupt vector offsets

.equ SPI0_INT_voffset = 0

; USART0 interrupt vector offsets

.equ USART0_RXC_voffset = 0
.equ USART0_DRE_voffset = 2
.equ USART0_TXC_voffset = 4

; PORTD interrupt vector offsets

.equ PORTD_PORT_voffset = 0

; AC0 interrupt vector offsets

.equ AC0_AC_voffset = 0

; ADC0 interrupt vector offsets

.equ ADC0_RESRDY_voffset = 0
.equ ADC0_WCMP_voffset = 2

; ZCD0 interrupt vector offsets

.equ ZCD0_ZCD_voffset = 0

; PTC interrupt vector offsets

.equ PTC_PTC_voffset = 0

; AC1 interrupt vector offsets

.equ AC1_AC_voffset = 0

; PORTC interrupt vector offsets

.equ PORTC_PORT_voffset = 0

; TCB2 interrupt vector offsets

.equ TCB2_INT_voffset = 0

; USART1 interrupt vector offsets

.equ USART1_RXC_voffset = 0
.equ USART1_DRE_voffset = 2
.equ USART1_TXC_voffset = 4

; PORTF interrupt vector offsets

.equ PORTF_PORT_voffset = 0

; NVMCTRL interrupt vector offsets

.equ NVMCTRL_EE_voffset = 0

; SPI1 interrupt vector offsets

.equ SPI1_INT_voffset = 0

; USART2 interrupt vector offsets

.equ USART2_RXC_voffset = 0
.equ USART2_DRE_voffset = 2
.equ USART2_TXC_voffset = 4

; AC2 interrupt vector offsets

.equ AC2_AC_voffset = 0

; TWI1 interrupt vector offsets

.equ TWI1_TWIS_voffset = 0
.equ TWI1_TWIM_voffset = 2



.equ INT_VECTORS_SIZE = 88 ; size in words


#endif /* _AVR32DA32DEF_INC_ */

; ***** END OF FILE ******************************************************



